src/Documents/ИТСервисы_ФормированиеКомандыПроекта/ИТСервисы_ФормированиеКомандыПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_ФормированиеКомандыПроекта</name>
  <registerRecords>InformationRegister.ИТСервисы_КомандыПроектов</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ИТСервисы_Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Участники</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>РольВКоманде</name>
      <type>
        <types>CatalogRef.ИТСервисы_РолиВКомандах</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыделяемыйПроцент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ИТСервисы_КомандыПроектов/ИТСервисы_КомандыПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_КомандыПроектов</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЧасовНаПроекте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЛимитЧасовВМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентЗагрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ИТСервисы_Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РольВКоманде</name>
    <type>
      <types>CatalogRef.ИТСервисы_РолиВКомандах</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ИТСервисы_КвалификацияСотрудников/ИТСервисы_КвалификацияСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИТСервисы_КвалификацияСотрудников</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СтавкаЧас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаЧасовВМесяц</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Грейд</name>
    <type>
      <types>EnumRef.ИТСервисы_Грейды</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Роль</name>
    <type>
      <types>CatalogRef.ИТСервисы_РолиВКомандах</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ИТСервисы_СтатусыПроектов/ИТСервисы_СтатусыПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИТСервисы_СтатусыПроектов</name>
  <enumValues>
    <name>Планируется</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ИТСервисы_ФормированиеКомандыПроекта/ObjectModule.bsl
#Область ОбработкаПроведения

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт	
	Движения.ИТСервисы_КомандыПроектов.Записывать = Истина;
	Движения.ИТСервисы_КомандыПроектов.Очистить();
	Движения.ИТСервисы_КомандыПроектов.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧ.Сотрудник КАК Сотрудник,
	|	ТЧ.РольВКоманде КАК РольВКоманде,
	|	СУММА(ТЧ.ВыделяемыеЧасы) КАК ЗапрашиваемыеЧасы
	|ПОМЕСТИТЬ ВТ_Участники
	|ИЗ
	|	Документ.ИТСервисы_ФормированиеКомандыПроекта.Участники КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ТЧ.Сотрудник,
	|	ТЧ.РольВКоманде
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Сотрудник КАК Сотрудник,
	|	СУММА(ВТ.ЗапрашиваемыеЧасы) КАК ЗапрошеноВсегоВДокументе
	|ПОМЕСТИТЬ ВТ_ЗапросСводно
	|ИЗ
	|	ВТ_Участники КАК ВТ
	|СГРУППИРОВАТЬ ПО
	|	ВТ.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Участники.Сотрудник КАК Сотрудник,
	|	ПРЕДСТАВЛЕНИЕ(ВТ_Участники.Сотрудник) КАК Имя,
	|	ВТ_Участники.РольВКоманде КАК РольВКоманде,
	|	ВТ_Участники.ЗапрашиваемыеЧасы КАК ЗапрашиваемыеЧасы,
	|	ЕСТЬNULL(ВТ_ЗапросСводно.ЗапрошеноВсегоВДокументе, 0) КАК ЗапрошеноВсегоФизически,
	|	ЕСТЬNULL(Квалификация.НормаЧасовВМесяц, 0) КАК НормаЧасовПоРоли,
	|	ЕСТЬNULL(МаксНорма.ФизическаяНорма, 0) КАК ФизическаяНорма,
	|	ЕСТЬNULL(ЗанятостьВсего.УжеЗанятЧасов, 0) КАК ТекущаяЗагрузкаВсего
	|ИЗ
	|	ВТ_Участники КАК ВТ_Участники
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ЗапросСводно КАК ВТ_ЗапросСводно
	|		ПО ВТ_Участники.Сотрудник = ВТ_ЗапросСводно.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИТСервисы_КвалификацияСотрудников.СрезПоследних(&Период, Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТ_Участники)) КАК Квалификация
	|		ПО ВТ_Участники.Сотрудник = Квалификация.Сотрудник
	|			И ВТ_Участники.РольВКоманде = Квалификация.Роль
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Квал.Сотрудник КАК Сотрудник,
	|			СУММА(Квал.НормаЧасовВМесяц) КАК ФизическаяНорма
	|		ИЗ
	|			РегистрСведений.ИТСервисы_КвалификацияСотрудников.СрезПоследних(&Период, Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТ_Участники)) КАК Квал
	|		СГРУППИРОВАТЬ ПО
	|			Квал.Сотрудник) КАК МаксНорма
	|		ПО ВТ_Участники.Сотрудник = МаксНорма.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Команды.Сотрудник КАК Сотрудник,
	|			СУММА(Команды.ЧасовНаПроекте) КАК УжеЗанятЧасов
	|		ИЗ
	|			РегистрСведений.ИТСервисы_КомандыПроектов.СрезПоследних(&Период, Сотрудник В (ВЫБРАТЬ Сотрудник ИЗ ВТ_Участники) И Проект <> &Проект) КАК Команды
	|		ГДЕ
	|			Команды.Проект.Статус <> ЗНАЧЕНИЕ(Перечисление.ИТСервисы_СтатусыПроектов.Завершен)
	|		СГРУППИРОВАТЬ ПО
	|			Команды.Сотрудник) КАК ЗанятостьВсего
	|		ПО ВТ_Участники.Сотрудник = ЗанятостьВсего.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СотрудникиСОшибкой = Новый Соответствие; 
	
	Пока Выборка.Следующий() Цикл
		СвободноФизически = Выборка.ФизическаяНорма - Выборка.ТекущаяЗагрузкаВсего;
		
		Если Выборка.ЗапрошеноВсегоФизически > СвободноФизически Тогда
			
			Если СотрудникиСОшибкой.Получить(Выборка.Сотрудник) = Неопределено Тогда
				ТекстОшибки = СтрШаблон(
					"Физическая перегрузка сотрудника %1! Запрошено в документе (по всем ролям): %2 ч. Свободно: %3 ч. (Макс. норма: %4 ч., Уже занят на других проектах: %5 ч.)",
					Выборка.Имя, Выборка.ЗапрошеноВсегоФизически, СвободноФизически, Выборка.ФизическаяНорма, Выборка.ТекущаяЗагрузкаВсего
				);
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = ТекстОшибки;
				Сообщение.Сообщить();
				Отказ = Истина;
				
				СотрудникиСОшибкой.Вставить(Выборка.Сотрудник, Истина);
			КонецЕсли;
			
		ИначеЕсли НЕ Отказ Тогда
			Движение = Движения.ИТСервисы_КомандыПроектов.Добавить();
			Движение.Период = Дата;
			Движение.Проект = Проект;
			Движение.Сотрудник = Выборка.Сотрудник;
			Движение.РольВКоманде = Выборка.РольВКоманде;
			Движение.ЧасовНаПроекте = Выборка.ЗапрашиваемыеЧасы;
			
			Движение.ЛимитЧасовВМесяц = Выборка.НормаЧасовПоРоли; 

			Если Выборка.ФизическаяНорма > 0 Тогда
				Движение.ПроцентЗагрузки = Окр((Выборка.ЗапрашиваемыеЧасы / Выборка.ФизическаяНорма) * 100, 2);
			Иначе
				Движение.ПроцентЗагрузки = 0;
			КонецЕсли;
		КонецЕсли;		
	КонецЦикла;	
КонецПроцедуры

#КонецОбласти
